album-artwork-gallery/app/controllers/api/v1/albums_controller.rb

SELECT "albums".* FROM "albums"
---
    def index
        albums = Album.all

INSERT INTO "albums" ("origin", "artist", "title", "tracks", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        album = Album.new(album_params)
        if album.save