album-artwork-gallery/app/controllers/api/v1/covers_controller.rb

SELECT "covers".* FROM "covers" WHERE "covers"."album_id" = $1  [["album_id", 1]]
---
def index
    covers = Cover.all

INSERT INTO "covers" ("image_url", "album_id", "stars", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def create
    cover = Cover.new(cover_params)
    if cover.save